app/controllers/correspondences_controller.rb

SELECT "correspondences".* FROM "correspondences"
---
  def index
    @correspondences = Correspondence.all

INSERT INTO "correspondences" ("subject", "office", "sample_message", "triggers", "format", "audience", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @correspondence = Correspondence.new(correspondence_params)

    respond_to do |format|
      if @correspondence.save

SELECT  "correspondences".* FROM "correspondences" WHERE "correspondences"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_correspondence
      @correspondence = Correspondence.find(params[:id])